In [77]:
import pandas as pd
import numpy as np

### Zamień nagłówki kolumn na polskie odpowiedniki: ['TYTUŁ','ARTYSTA','ROK','MAX POZ']

In [78]:
data = pd.read_html('https://www.officialcharts.com/chart-news/the-best-selling-albums-of-all-time-on-the-official-uk-chart__15551/', header=0)

In [79]:
table = pd.DataFrame(data[0])

In [80]:
table.rename(columns={'POS': 'POZ', 'TITLE': 'TYTUŁ', 'ARTIST': 'ARTYSTA', 'YEAR': 'ROK', 'HIGH POSN': 'MAX POZ'}, inplace = True)

In [81]:
table.head()

   POZ                                 TYTUŁ  ARTYSTA   ROK  MAX POZ
0    1                         GREATEST HITS    QUEEN  1981        1
1    2                  GOLD - GREATEST HITS     ABBA  1992        1
2    3  SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES  1967        1
3    4                                    21    ADELE  2011        1
4    5        WHAT'S THE STORY MORNING GLORY    OASIS  1995        1

### Ilu pojedynczych artystów znajduje się na liście?

In [82]:
artist = table['ARTYSTA'].nunique()
artist

47

### Które zespoły pojawiają się najczęściej na liście?

In [83]:
artist_top = table['ARTYSTA'].value_counts().head()

In [84]:
artist_top

COLDPLAY         3
TAKE THAT        3
FLEETWOOD MAC    2
ABBA             2
DIDO             2
Name: ARTYSTA, dtype: int64

### Zmień nagłówki kolumn, tak aby każdy z nich rozpoczynał się od wielkiej litery, a pozostałe były wprowadzone małymi literami.

In [85]:
table.rename(str.capitalize, axis='columns', inplace = True)
table.head()

   Poz                                 Tytuł  Artysta   Rok  Max poz
0    1                         GREATEST HITS    QUEEN  1981        1
1    2                  GOLD - GREATEST HITS     ABBA  1992        1
2    3  SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES  1967        1
3    4                                    21    ADELE  2011        1
4    5        WHAT'S THE STORY MORNING GLORY    OASIS  1995        1

### Wyrzuć z tabeli kolumnę ‘Max Poz’.

In [86]:
table.drop(columns = 'Max poz', inplace = True)

In [87]:
table.head()

   Poz                                 Tytuł  Artysta   Rok
0    1                         GREATEST HITS    QUEEN  1981
1    2                  GOLD - GREATEST HITS     ABBA  1992
2    3  SGT PEPPER'S LONELY HEARTS CLUB BAND  BEATLES  1967
3    4                                    21    ADELE  2011
4    5        WHAT'S THE STORY MORNING GLORY    OASIS  1995

### W którym roku wyszło najwięcej albumów znajdujących się na liście?

In [88]:
table_y_max = table['Rok'].value_counts()
table_y_max.head()

2000    4
1987    4
2006    3
1977    3
1998    3
Name: Rok, dtype: int64

### Ile albumów wydanych między 1960 a 1990 rokiem włącznie znajduje się na liście?

In [89]:
t_60_90 = table[(table['Rok'] >= 1960) & (table['Rok'] <= 1990)]['Rok']
t_60_90.count()

22

### W którym roku wydany został najmłodszy album na liście?

In [90]:
table[table['Rok'] == min(table['Rok'])]

    Poz               Tytuł                  Artysta   Rok
51   52  THE SOUND OF MUSIC  ORIGINAL CAST RECORDING  1965

### Przygotuj listę najwcześniej wydanych albumów każdego artysty, który znalazł się na liście.

In [95]:
artist_first_on_top = table.groupby('Artysta').agg({'Tytuł':'first','Rok':'min'})

In [102]:
artist_first_on_top.sort_values('Rok').head()

                                                        Tytuł   Rok
Artysta
ORIGINAL CAST RECORDING                    THE SOUND OF MUSIC  1965
BEATLES                  SGT PEPPER'S LONELY HEARTS CLUB BAND  1967
SIMON & GARFUNKEL                  BRIDGE OVER TROUBLED WATER  1970
PINK FLOYD                          THE DARK SIDE OF THE MOON  1973
MIKE OLDFIELD                                   TUBULAR BELLS  1973

### Listę zapisz do pliku csv

In [99]:
list_to_excel = artist_first_on_top.sort_values('Rok')

In [101]:
list_to_excel.to_csv('ArtistFirstOnTop.xlsx', index=False)